# PrintParameters Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
PrintParameters Class
Members See Also
---
An object that contains settings used for printing the document.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public class PrintParameters : APIObject
```

Visual Basic
---
```text
Public Class PrintParameters _
	Inherits APIObject
```

Visual C++
---
```text
public ref class PrintParameters : public APIObject
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..APIObject Autodesk.Revit.DB..::..PrintParameters
# See Also
PrintParameters Members
Autodesk.Revit.DB Namespace